loadTesting/loadTesting.yaml
config:
  target: "ws://139.59.139.151:8080/api/v1/client/"
  phases:
    - duration: 10
      arrivalRate: 100
  ws:
    # Ignore SSL certificate errors
    # - useful in *development* with self-signed certs
    rejectUnauthorized: false
scenarios:
  - engine: "ws"
    flow:
      - send: "{\"type\":\"client\",\"action\":\"sendFirstMessage\",\"body\":{\"author\" : \"client\",\"body\": \"сообщение\"}}"
      - send: "{\"type\":\"client\",\"action\":\"sendMessage\",\"body\":{\"author\" : \"client\",\"body\": \"сообщение\"}}"
      - send: "{\"type\":\"client\",\"action\":\"sendMessage\",\"body\":{\"author\" : \"client\",\"body\": \"сообщение\"}}"
      #- think : 1